update readme test
